Data Frame - Conditional Selection

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [47]:
np.random.seed(101)

In [54]:
#### creating a data frame

my_df_cond = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [55]:
my_df_cond

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [56]:
### operators - conditional selection- comparison operator
### select all values from data frame that are greater than 0
my_df_cond = my_df_cond>0
print(my_df_cond)
print(type(my_df_cond))

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True
<class 'pandas.core.frame.DataFrame'>

In [58]:
booldf_cond = my_df_cond>0

#### output will be a boolean data frame

In [59]:
### The above gives a  boolean data Frame
booldf_cond

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [60]:
#### to get values use bracket notation 

my_df_cond[booldf_cond]

     W    X    Y    Z
A  1.0  1.0  NaN  NaN
B  NaN  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0
D  NaN  NaN  NaN  1.0
E  NaN  1.0  1.0  1.0

In [10]:
df1

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [61]:
#### another way of extracting values using bracket notation 
### note 2 statements have been shrunk to one statement
my_df_cond[my_df_cond>0]

     W    X    Y    Z
A  1.0  1.0  NaN  NaN
B  NaN  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0
D  NaN  NaN  NaN  1.0
E  NaN  1.0  1.0  1.0

In [12]:
df1

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [13]:
#### to get a subset of values satisfying a particular condition
df1['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [14]:
#### using bracket notation, we can get only the rows where this cond is satisfied
df1[df1['W']>0]

#### remember that the result just ignored the row with C as index. 
### Note that the row 'C' with "NaN" value was left out beecause W > 0 failed there

      W      X      Y     Z
A  True   True   True  True
B  True  False  False  True
D  True  False  False  True
E  True   True   True  True

In [15]:
df1

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [16]:
#### grab all the rows where Z< 0.6
df1[df1['Z'] < 0.6]

       W     X     Y      Z
C  False  True  True  False

In [17]:
### assigning conditional operations on data frame to a variable
resultdf=df1[df1['W']>0] 

print('/n')

### print result set- which itself is a dataframe. meaning i can do other operations on this resultset
print(resultdf)

/n
      W      X      Y     Z
A  True   True   True  True
B  True  False  False  True
D  True  False  False  True
E  True   True   True  True

In [18]:
##### extracting data from the above resultset - eg extract column X from result set
df1[df1['W']>0.6][['W','X','Y']]

      W      X      Y
A  True   True   True
B  True  False  False
D  True  False  False
E  True   True   True

In [19]:
 #### alternate way to extract data from a result set of a conditional op on a data frame
df1[df1['W']>0]['X']

A     True
B    False
D    False
E     True
Name: X, dtype: bool

In [20]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 
#### note double bracket notation indicating multiple col extraction

df1[df1['W']>0]  [['X','Y']]  




####

       X      Y
A   True   True
B  False  False
D  False  False
E   True   True

In [21]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 

df1
#### note double bracket notation indicating multiple col extraction

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [22]:
##### multiple conditions column extraction

In [23]:
df1[(df1['W']>0) & (df1['Y']>1)] [['W','X','Y','Z']]  

### we get an error that "truth values of series ambiguous"
## and operator can return only single boolean values at a time. but for an entire series of boolean values, it will be confused and so 
### we use the "&"

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [24]:
(df1['W']>0) & (df1['Y']>1)

A    False
B    False
C    False
D    False
E    False
dtype: bool

In [25]:
df1[(df1['W']>0) & (df1['Y']>1)]     #### & operator equivalent to and. using and will give an error

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [26]:
df1[(df1['W']>0) | (df1['Y']>1)]     ##### | operator equivalent to or

      W      X      Y     Z
A  True   True   True  True
B  True  False  False  True
D  True  False  False  True
E  True   True   True  True

In [27]:
df1 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [28]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [29]:
df1.reset_index()  #### resets index, but not inplace reset

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [30]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [31]:
df1.reset_index(drop=True,inplace=True) ### will reset the index permanently

In [32]:
 df1

          W         X         Y         Z
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [33]:
df1.reset_index(drop=True,inplace=True)

In [34]:
df1

          W         X         Y         Z
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [35]:
#### adding a new column to data frame

In [36]:
newstring = 'CA NY NJ OH CO'

In [37]:
newx = newstring.split()

In [38]:
df1['States'] = newx
df1

          W         X         Y         Z States
0  0.302665  1.693723 -1.706086 -1.159119     CA
1 -0.134841  0.390528  0.166905  0.184502     NY
2  0.807706  0.072960  0.638787  0.329646     NJ
3 -0.497104 -0.754070 -0.943406  0.484752     OH
4 -0.116773  1.901755  0.238127  1.996652     CO

In [39]:
newstring1 = 'CA NY NJ OH'

In [40]:
### step1 - create a new list from a string 
newx1 = newstring1.split()
newx1

['CA', 'NY', 'NJ', 'OH']

In [41]:
df1

          W         X         Y         Z States
0  0.302665  1.693723 -1.706086 -1.159119     CA
1 -0.134841  0.390528  0.166905  0.184502     NY
2  0.807706  0.072960  0.638787  0.329646     NJ
3 -0.497104 -0.754070 -0.943406  0.484752     OH
4 -0.116773  1.901755  0.238127  1.996652     CO

In [42]:
###step2 add a column to data frame df1 and call it States
df1['States1'] = newx1
df1

ValueError: Length of values does not match length of index

In [ ]:
df1

In [ ]:
#### if we want to make the column States as Index

df1.set_index('States')

#### note the States has become index

In [ ]:
df1

In [ ]:
df1

In [ ]:
#### difference between reset and set index is
#### reset index resets to new index and makes the old index as a column in the data frame
#### set index completely overrides the old index
### note both reset and set will become permanent ONLY when using INPLACE argument

In [ ]:
#### EXTRACTS rows using conditions
resultdf_rows = df1.loc['A'] > 1
resultdf_rows